var c: array[0..9] of integer; // c[1] сколько раз встречался остаток 1 при делении на 10
    n,i,a,k: integer;
    


begin
  read(n);
  for i:= 0 to 9 do c[i]:=0;
  
  for i:= 1 to n do
  begin
      
      read(a);
      inc(c[a mod 10]);
      
  end;
   { 5 чисел, которые при делении на 10 дают остаток 1   11,21,31,51,71
      4 числа, которые при делении на 10 дают остаток 9
                                                    109,119,129,139
        20 = с[1]*c[9]   c[2]*c[8] c[3]*c[7] c[4]*c[6]
   }
   
   k:=0;
   for i:= 1 to 4 do k:=k+c[i]*c[10-i];
   k:=k+(c[5]*c[5]+c[0]*c[0]-c[5]-c[0]) div 2;
   
   {    c[5]          c[5]*(c[5]-1)/2
        c[0]      10,20,30,40,50  4+3+2+1
                      c[0]*(c[0]-1)/2
                  
   
   
   }
  
    write(k);  
  
  
  
  
  
  
end.