// а какие переменные будут

var A: array[1..10] of integer;
    n, picachuuu2: integer;
    
begin
// прочитать данные (из интернета, из файла, с клавиатуры)
write('введите количество элементов: ');
read(n);  // n - количество элементов
write('введите все элементы: ');  
for i:= 1 to n do readln(A[i]);

// че нибудь изменить че нибудь посчитать
picachuuu2:=0; // инициализация
// последний элемент a[n]
for i:= 1 to n do   if a[i]>a[n] then picachuuu2:=picachuuu2+1;

// вывести данные куда-нибудь (на экран, в файл, на сайт, на почту)
write(picachuuu2);
end.