








// объявляете переменные, указываете тип каждой переменной, которую вы будете использовать!!!!!!!
var A: array[0..5] of integer;  //массив
    n,i,sum: integer;            // n количество элементов массива
                                 // i переменная цикла ходит массиву
                                 // sum перменная накапливать массив
begin
    writeln('Сколько элементов будет в массиве?');
    readln(n);
    for i:= 0 to n-1 do readln(a[i]);
    
    
    // инициализация
    sum:=0;
    for i:= 0 to n-1 do 
      sum:= sum+a[i];
    
    
    writeln(sum);
end.